Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/НастройкиТемОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемОбщенияСУО</name>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СообщенияТемСУО/СообщенияТемСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияТемСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/АктивностьУчастниковОбщенияСУО/АктивностьУчастниковОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивностьУчастниковОбщенияСУО</name>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СообщениеСУОПрисоединенныеФайлы/СообщениеСУОПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщениеСУОПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеЦифровыеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/ОбщениеСУО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Темы

&НаКлиенте
Процедура УстановитьПериодОбновленияСпискаТем()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСписокТем");
	
	Если ЧастотаОбновленияСпискаТем > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписокТем", ЧастотаОбновленияСпискаТем);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписокТем()
	
	Если Элементы.Новые.Пометка Тогда
		Возврат; // Отключаем обновление тем, чтобы они сами не пропадали
	КонецЕсли;
	
	Элементы.Темы.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусТемы(Тема, ИмяРеквизита=Неопределено, Значение=Неопределено)
	
	Справочники.ТемыСообщенийСУО.ЗаписатьПользовательскиеНастройкиТемы(Тема, ИмяРеквизита, Значение, Пользователи.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусТемыНаКлиенте(ИмяРеквизита, Значение=Неопределено)
	
	ТекущиеДанные = Элементы.Темы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		Значение = ?(ТекущиеДанные[ИмяРеквизита], Ложь, Истина); // Устанавливаем значение, противоположное текущему.
	КонецЕсли;
	
	ИзменитьСтатусТемы(ТекущиеДанные.Тема, ИмяРеквизита, Значение);
	
	Элементы.Темы.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТем(ИмяОтбора=Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Темы.Отбор, "Архивирована");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Темы.Отбор, "Удалена");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Темы.Отбор, "Помечена");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Темы.Отбор, "ЭтоАвтор");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Темы.Отбор, "ЕстьНовыеСообщения");
	
	Если ИмяОтбора = Неопределено Тогда
		ИмяОтбора = "Входящие";
	КонецЕсли;
	
	Если ИмяОтбора = "Входящие" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Архивирована", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Удалена", Ложь);
		Элементы.Входящие.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Истина;
		Элементы.КомандаУдалить.Доступность = Истина;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Ложь;
	Иначе
		Элементы.Входящие.Пометка = Ложь;
	КонецЕсли;
	
	Если ИмяОтбора = "Новые" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "ЕстьНовыеСообщения", Истина);
		Элементы.Новые.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Истина;
		Элементы.КомандаУдалить.Доступность = Истина;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Ложь;
	Иначе
		Элементы.Новые.Пометка = Ложь;
	КонецЕсли;
	
	Если ИмяОтбора = "Помеченные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Помечена", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Удалена", Ложь);
		Элементы.Помеченные.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Истина;
		Элементы.КомандаУдалить.Доступность = Истина;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Ложь;
	Иначе
		Элементы.Помеченные.Пометка = Ложь;
	КонецЕсли;
	
	Если ИмяОтбора = "Отправленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "ЭтоАвтор", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Удалена", Ложь);
		Элементы.Отправленные.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Истина;
		Элементы.КомандаУдалить.Доступность = Истина;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Ложь;
	Иначе
		Элементы.Отправленные.Пометка = Ложь;
	КонецЕсли;
	
	Если ИмяОтбора = "Все" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Удалена", Ложь);
		Элементы.ВсеТемы.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Ложь;
		Элементы.КомандаУдалить.Доступность = Истина;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Истина;
	Иначе
		Элементы.ВсеТемы.Пометка = Ложь;
	КонецЕсли;
	
	Если ИмяОтбора = "Корзина" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Удалена", Истина);
		Элементы.Корзина.Пометка = Истина;
		Элементы.КомандаАрхивировать.Доступность = Истина;
		Элементы.КомандаУдалить.Доступность = Ложь;
		Элементы.ТемыКонтекстноеМенюВосстановить.Доступность = Истина;
	Иначе
		Элементы.Корзина.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Обсуждение темы

&НаСервереБезКонтекста
Функция ПолучитьДокументСообщения(НомерСообщения, УникальныйИдентификатор=Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сообщение = Документы.СообщениеСУО.НайтиПоНомеру(НомерСообщения);
	
	Если УникальныйИдентификатор = Неопределено Тогда
		Возврат Сообщение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУОПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.СообщениеСУОПрисоединенныеФайлы КАК СообщениеСУОПрисоединенныеФайлы
		|ГДЕ
		|	СообщениеСУОПрисоединенныеФайлы.ВладелецФайла = &Сообщение";

	Запрос.УстановитьПараметр("Сообщение", Сообщение);

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаДетальныеЗаписи.Ссылка, УникальныйИдентификатор);
		
	Иначе
		
		Возврат Сообщение;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАвтораСообщения(УникальныйИдентификатор)
	Возврат Справочники.Пользователи.ПолучитьСсылку(УникальныйИдентификатор);
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьСообщение(Знач Тема, Знач Сообщение, Знач ИнформацияОПрикрепленныхФайлах, Отказ)
	
	НачатьТранзакцию();
	
	СообщениеОбъект = Документы.СообщениеСУО.СоздатьДокумент();
	СообщениеОбъект.Дата         = ТекущаяДатаСеанса();
	СообщениеОбъект.Пользователь = Пользователи.ТекущийПользователь();
	СообщениеОбъект.Тема         = Тема;
	
	ХранилищеСообщения = Новый ХранилищеЗначения(Сообщение, Новый СжатиеДанных(9));  
	СообщениеОбъект.ФорматированныйДокумент = ХранилищеСообщения;
	
	СообщениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// Прикрепляем файл
	
	Если ТипЗнч(ИнформацияОПрикрепленныхФайлах) = Тип("ФиксированныйМассив") Тогда
		
		Для каждого ИнформацияОПрикрепленномФайле Из ИнформацияОПрикрепленныхФайлах Цикл
		
		// Создадим карточку Файла в БД
		ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(
									СообщениеОбъект.Ссылка,
									ИнформацияОПрикрепленномФайле.ИмяБезРасширения,
									ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ИнформацияОПрикрепленномФайле.Расширение),
									,
									,
									ИнформацияОПрикрепленномФайле.Адрес);
									
			
		
		КонецЦикла;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСообщениеНаСервере(Тема)
	
	// Примечание: сохранение сообщения происходит в настоящее время при помощи обычной серверной
	// Процедуры, так как при передачи сообщения с клиента на сервер при использовании
	// Внеконтекстного вызова серверной процедуры возникают ошибки.
	
	Отказ = Ложь;
	СохранитьСообщение(Тема, Сообщение, ИнформацияОПрикрепленныхФайлах, Отказ);
	
	Если НЕ Отказ Тогда
		
		Сообщение.Удалить(); // Очищаем поле форматированного документа
		
		ИнформацияОПрикрепленныхФайлах = Неопределено;
		Элементы.ИнформацияОПрикрепленномФайле.Заголовок = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьXDTOСообщений(ТаблицаСообщений, НомерРодительскогоСообщения, ДатаПросмотра, СообщенияXDTO, СообщениеXDTOТип, ПользовательXDTOТип, Знач Уровень, ДеревоСообщений)
	
	Если ДеревоСообщений Тогда
	
		Уровень = Уровень + 1;
		
		СтрокиДляОбхода = ТаблицаСообщений.НайтиСтроки(Новый Структура("НомерРодительскогоСообщения", НомерРодительскогоСообщения));
		
	Иначе
		
		СтрокиДляОбхода = ТаблицаСообщений;
		
	КонецЕсли;
		
	Для каждого Строка Из СтрокиДляОбхода Цикл
			
		СообщениеXDTO = Документы.СообщениеСУО.СообщениеXDTO(Строка.Сообщение, Строка, СообщениеXDTOТип, ПользовательXDTOТип);
		
		Если ЗначениеЗаполнено(ДатаПросмотра) И Строка.Дата > ДатаПросмотра Тогда
			СообщениеXDTO.Новое = Истина;
		Иначе
			СообщениеXDTO.Новое = Ложь;
		КонецЕсли;
		
		СообщениеXDTO.Уровень = Уровень;
		
		СообщенияXDTO.Сообщение.Добавить(СообщениеXDTO);
		
		Если ДеревоСообщений Тогда
			
			ДобавитьXDTOСообщений(ТаблицаСообщений, Строка.Номер, ДатаПросмотра, СообщенияXDTO, СообщениеXDTOТип, ПользовательXDTOТип, Уровень, ДеревоСообщений); // Рекурсия
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбсуждения(Тема, НовыеВверху, ДеревоСообщений, ДатаПросмотра, Пользователь, ЭтоФорум, ПервыйПоказ, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	ДанныеТемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Кому, Контекст, Закрыта");
	
	Если ДатаПросмотра = Неопределено Тогда
		
		Запрос = Новый Запрос;
		
		Если ЭтоФорум Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиТемФорумаСУО.ДатаПросмотра
			|ИЗ
			|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
			|ГДЕ
			|	НастройкиТемФорумаСУО.Пользователь = &Пользователь
			|	И НастройкиТемФорумаСУО.Тема = &Тема";
			
		Иначе
		
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиТемОбщенияСУО.ДатаПросмотра
			|ИЗ
			|	РегистрСведений.НастройкиТемОбщенияСУО КАК НастройкиТемОбщенияСУО
			|ГДЕ
			|	НастройкиТемОбщенияСУО.Пользователь = &Пользователь
			|	И НастройкиТемОбщенияСУО.Тема = &Тема";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Тема", Тема);

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			
			ДатаПросмотра = Дата("00010101");
			
		Иначе
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();

			ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;
			
		КонецЕсли;
			
	КонецЕсли;
	
	
	// Выбираем все сообщения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияТемСУО.ФорматированныйДокумент КАК ФорматированныйДокумент,
		|	СообщенияТемСУО.Регистратор КАК Документ,
		|	СообщенияТемСУО.Номер КАК Номер,
		|	СообщенияТемСУО.Период КАК Дата,
		|	СообщенияТемСУО.Пользователь КАК Пользователь,
		|	СообщенияТемСУО.Пользователь.Наименование КАК ИмяПользователя,
		|	СообщенияТемСУО.Шаблон,
		|	СообщенияТемСУО.РодительскоеСообщение
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
		|ГДЕ
		|	СообщенияТемСУО.Тема = &Тема
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";

		
	Если НовыеВверху Тогда
		Запрос.Текст = Запрос.Текст + " УБЫВ";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Тема", Тема);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Формируем массив документов СообщениеСУО
	
	МассивДокументов = Новый Массив();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Документ);
	КонецЦикла;

	ЗапросФайлов = Новый Запрос;
	ЗапросФайлов.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУОПрисоединенныеФайлы.Ссылка КАК Файл,
		|	СообщениеСУОПрисоединенныеФайлы.ВладелецФайла КАК Сообщение
		|ИЗ
		|	Справочник.СообщениеСУОПрисоединенныеФайлы КАК СообщениеСУОПрисоединенныеФайлы
		|ГДЕ
		|	СообщениеСУОПрисоединенныеФайлы.ВладелецФайла В(&МассивСообщений)";

	ЗапросФайлов.УстановитьПараметр("МассивСообщений", МассивДокументов);

	ТаблицаФайловСообщений = ЗапросФайлов.Выполнить().Выгрузить();
	
	// Формируем таблицу сообщений
	
	ТаблицаСообщений = Новый ТаблицаЗначений();
	ТаблицаСообщений.Колонки.Добавить("ТекстHTML");
	ТаблицаСообщений.Колонки.Добавить("Пользователь");
	ТаблицаСообщений.Колонки.Добавить("ИмяПользователя");
	ТаблицаСообщений.Колонки.Добавить("Номер");
	ТаблицаСообщений.Колонки.Добавить("Дата");
	ТаблицаСообщений.Колонки.Добавить("ЕстьПрикрепленныеФайлы");
	ТаблицаСообщений.Колонки.Добавить("Сообщение");
	ТаблицаСообщений.Колонки.Добавить("РодительскоеСообщение");
	ТаблицаСообщений.Колонки.Добавить("НомерРодительскогоСообщения");
	ТаблицаСообщений.Колонки.Добавить("Уровень");
	
	МассивРесурсовДляКэширования = Новый Массив();
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщение  = ВыборкаДетальныеЗаписи.ФорматированныйДокумент.Получить();
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Шаблон) Тогда
			ИдентификаторСообщения  = Строка(ВыборкаДетальныеЗаписи.Шаблон.УникальныйИдентификатор());
			Ресурс                  = ВыборкаДетальныеЗаписи.Шаблон;
		Иначе
			ИдентификаторСообщения  = Строка(ВыборкаДетальныеЗаписи.Документ.УникальныйИдентификатор());
			Ресурс                  = ВыборкаДетальныеЗаписи.Документ;
		КонецЕсли;
		
		НоваяСтрокаТС = ТаблицаСообщений.Добавить();
		
		НоваяСтрокаТС.ТекстHTML             = ОбщегоНазначенияСУ.ПредставлениеФорматированныйДокументДляПоляHTML(Сообщение, ИдентификаторФормы);
		НоваяСтрокаТС.Пользователь          = ВыборкаДетальныеЗаписи.Пользователь;
		НоваяСтрокаТС.ИмяПользователя       = ВыборкаДетальныеЗаписи.ИмяПользователя;
		НоваяСтрокаТС.Номер                 = ВыборкаДетальныеЗаписи.Номер;
		НоваяСтрокаТС.Дата                  = ВыборкаДетальныеЗаписи.Дата;
		НоваяСтрокаТС.РодительскоеСообщение = ВыборкаДетальныеЗаписи.РодительскоеСообщение;
		НоваяСтрокаТС.Сообщение             = ВыборкаДетальныеЗаписи.Документ;
	
		Если ТаблицаФайловСообщений.Найти(ВыборкаДетальныеЗаписи.Документ, "Сообщение") = Неопределено Тогда
			НоваяСтрокаТС.ЕстьПрикрепленныеФайлы = Ложь;
		Иначе
			НоваяСтрокаТС.ЕстьПрикрепленныеФайлы = Истина;
		КонецЕсли;
		
		НоваяСтрокаТС.НомерРодительскогоСообщения = "";
		
	КонецЦикла;

	ЭтоДерево = Ложь;
	
	Если ДеревоСообщений Тогда
		
		Для каждого Строка Из ТаблицаСообщений Цикл
			
			// Указываем номер родительского сообщения
			
			Если ЗначениеЗаполнено(Строка.РодительскоеСообщение) Тогда
				
				СтрокаРодительская = ТаблицаСообщений.Найти(Строка.РодительскоеСообщение, "Сообщение");
				
				Если СтрокаРодительская <> Неопределено Тогда
					
					Строка.НомерРодительскогоСообщения = СтрокаРодительская.Номер;
					
					ЭтоДерево = Истина;
					
				КонецЕсли;
				
			Иначе
				
				Строка.НомерРодительскогоСообщения = "";
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Формируем модель XML обсуждения через механизм XDTO.
	
	ОбсуждениеXDTOТип   = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Forum","Обсуждение");
	ОбсуждениеXDTO      = ФабрикаXDTO.Создать(ОбсуждениеXDTOТип);
	
	СообщенияXDTOТип    = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Forum","Сообщения");
	СообщенияXDTO       = ФабрикаXDTO.Создать(СообщенияXDTOТип);
	
	СообщениеXDTOТип    = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/Forum","Сообщение");
	ПользовательXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User","Пользователь");
	
	
	ДобавитьXDTOСообщений(ТаблицаСообщений, "", ДатаПросмотра, СообщенияXDTO, СообщениеXDTOТип, ПользовательXDTOТип, 0, ДеревоСообщений);
	
	ОбсуждениеXDTO.Сообщения = СообщенияXDTO;
	
	ОбсуждениеXDTO.ЭтоДерево = ЭтоДерево;
	ОбсуждениеXDTO.Закрыто   = ДанныеТемы.Закрыта;
	ОбсуждениеXDTO.ДоступноМодерирование = ?(ТипЗнч(ДанныеТемы.Контекст) = Тип("СправочникСсылка.Пользователи"), Ложь, Истина);
	
	// Получаем XML.
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбсуждениеXDTO);
	
	XMLДанныеОбсуждения = ЗаписьXML.Закрыть();
	
	// Получаем представление HTML.
	
	Преобразование = Новый ПреобразованиеXSL;
	ШаблонXSL = Справочники.ТемыСообщенийСУО.ПолучитьМакет("ШаблонОбсуждения").ПолучитьТекст();
	
	Преобразование.ЗагрузитьИзСтроки(ШаблонXSL);
	ИтоговыйHTML = Преобразование.ПреобразоватьИзСтроки(XMLДанныеОбсуждения);
	
	// Формируем структуру данных сообщения для возврата на клиент.
	
	ДанныеОбсуждения = Новый Структура("Представление, ПредставлениеКонтекстаТемы, ЭтоДерево", ИтоговыйHTML, Документы.СообщениеСУО.ПредставлениеКонтекстаСообщения(ДанныеТемы.Кому, ДанныеТемы.Контекст), ЭтоДерево);
		
	// Запоминаем последнюю дату просмотра темы
	
	ИзменитьСтатусТемы(Тема);
				
	Возврат ДанныеОбсуждения;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбсуждение(ПервыйПоказ=Ложь)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Тема) Тогда // Много тем
		
		ДатаПросмотра      = Неопределено;
		ТекущаяТема        = Неопределено;
		ТекущаяТемаЗакрыта = Истина;		
		ТекущийКонтекст    = Неопределено;
		ТекущийАдресат     = Неопределено;
		
		ТекущиеДанные = Элементы.Темы.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			
			ТекущаяТема        = ТекущиеДанные.Тема;
			ДатаПросмотра      = ТекущиеДанные.ДатаПросмотра;
			ТекущаяТемаЗакрыта = ТекущиеДанные.Закрыта;
			ТекущийКонтекст    = ТекущиеДанные.Контекст;
			ТекущийАдресат     = ТекущиеДанные.Кому;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяТема) Тогда
		
		Если Элементы.КомандаПоказатьСкрытьУчастников.Пометка Тогда
			Участники.Параметры.УстановитьЗначениеПараметра("Тема", ТекущаяТема);
		КонецЕсли;
		
		ДанныеОбсуждения = ПолучитьДанныеОбсуждения(ТекущаяТема, НовыеСообщениеРазмещатьВверху, ДеревоСообщений, ДатаПросмотра, ТекущийПользователь, ЭтоФорум, ПервыйПоказ, УникальныйИдентификатор); // Внеконтекстный вызов сервера
		
		// Запоминаем текущие данные открытой темы
		
		Обсуждение                 = ДанныеОбсуждения.Представление; // Реквизит формы
		ПредставлениеКонтекстаТемы = ДанныеОбсуждения.ПредставлениеКонтекстаТемы;  // Реквизит формы
		ЭтоДерево                  = ДанныеОбсуждения.ЭтоДерево; // Реквизит формы
		
	Иначе
		
		ПредставлениеКонтекстаТемы = ""; // Реквизит формы
		Обсуждение                 = ""; // Реквизит формы

		Участники.Параметры.УстановитьЗначениеПараметра("Тема", Неопределено);
		
	КонецЕсли;
	
	// Управляем видимостью элементов
	
	Если ЭтоФорум Тогда
		
		Элементы.ВашОтвет.Видимость = НЕ ТекущаяТемаЗакрыта;
		Элементы.ГруппаОтправкаСообщения.Видимость = НЕ ТекущаяТемаЗакрыта;
		
	Иначе
		
		Элементы.ВашОтвет.Доступность = НЕ ТекущаяТемаЗакрыта;
		Элементы.ГруппаОтправкаСообщения.Доступность = НЕ ТекущаяТемаЗакрыта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьОбсуждение()
	
	ЗагрузитьОбсуждение();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСтатусыПользователей()
	
	Если Элементы.Участники.Видимость Тогда
		Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодОбновленияИнформацииОбАктивностиУчастников()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСтатусыПользователей");
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьАктивностьПользователя");
	
	Если ЧастотаПроверкиСтатусаУчастников > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСтатусыПользователей", ЧастотаПроверкиСтатусаУчастников);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьАктивностьПользователя()
	УстановитьАктивностьПользователя(ТекущийПользователь);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьАктивностьПользователя(ТекущийПользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.АктивностьУчастниковОбщенияСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь            = ТекущийПользователь;
	НоваяЗапись.ДатаПоследнейАктивности = ТекущаяДата();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодОбновленияСообщений()
	
	ОтключитьОбработчикОжидания("Подключаемый_ЗагрузитьОбсуждение");
	
	Если ЧастотаОбновленияСообщений > 0 Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьОбсуждение", ЧастотаОбновленияСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьИлиИсключитьУчастникаОбсуждения(Тема, Участник, Действие)
	
	Если НЕ УправлениеДоступом.ЕстьРоль("УправлениеКоммуникациямиСУО") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Если Действие = "Добавить" Тогда
		ИмяТЧДляДобавления = "ДополнительныеПолучатели";
		ИмяТЧДляИсключения = "ИсключенныеПолучатели";
		ИмяОперации = "добавить"
	Иначе
		ИмяТЧДляДобавления = "ИсключенныеПолучатели";
		ИмяТЧДляИсключения = "ДополнительныеПолучатели";
		ИмяОперации = "исключить"
	КонецЕсли;		
	
	// Добавляем участника
	
	Если Участник = Пользователи.ТекущийПользователь() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запрещено %1 себя'"), ИмяОперации);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТемаОбъект = Тема.ПолучитьОбъект();
	
	Если ТемаОбъект.Автор = Участник Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запрещено %1 автора темы'"), ИмяОперации);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ТемаОбъект.Контекст = Участник Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Вы не можете %1 адресата темы. Действие отменено'"), ИмяОперации);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ТемаОбъект[ИмяТЧДляДобавления].Найти(Участник, "Пользователь") = Неопределено Тогда
		
		НоваяСтрокаТЧ = ТемаОбъект[ИмяТЧДляДобавления].Добавить();
		НоваяСтрокаТЧ.Пользователь = Участник;
		НоваяСтрокаТЧ.ДатаДобавления = ТекущаяДата();
		НоваяСтрокаТЧ.Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	СтрокаТЧДляУдаления = ТемаОбъект[ИмяТЧДляИсключения].Найти(Участник, "Пользователь");
	
	Если СтрокаТЧДляУдаления <> Неопределено Тогда
		ТемаОбъект[ИмяТЧДляИсключения].Удалить(СтрокаТЧДляУдаления);	
	КонецЕсли;
	
	ТемаОбъект.Записать();
	
	// Перепроводим сообщения

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеСУО.Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|ГДЕ
		|	СообщениеСУО.Проведен = ИСТИНА
		|	И СообщениеСУО.Тема = &Тема";

	Запрос.УстановитьПараметр("Тема", Тема);

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ОбщегоНазначенияСУ.ПерепровестиВыборкуДокументов(ВыборкаДетальныеЗаписи); 

	// Делаем проверки
	
	СписокУчастников = ПолучитьУчастниковОбсуждения(Тема);
	
	Если СписокУчастников.Количество() < 2 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество участников обсуждения должно быть не менее двух. Действие отменено'"));
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУчастниковОбсуждения(Тема)
	
	ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Контекст, Кому, Автор, ДатаСоздания, ДополнительныеПолучатели, ИсключенныеПолучатели");

	МассивУчастников = Документы.СообщениеСУО.ПолучателиСообщения(ДанныеОТеме);
	
	СписокУчастников = Новый СписокЗначений;
	
	СписокУчастников.ЗагрузитьЗначения(МассивУчастников);	
	
	Возврат СписокУчастников; 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем настройки по умолчанию
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек = Неопределено Тогда
		
		ЧастотаПроверкиСтатусаУчастников = 30;
		ЧастотаОбновленияСпискаТем       = 60;
		ЧастотаОбновленияСообщений       = 120;
		
		НовыеСообщениеРазмещатьВверху    = Ложь;
		ДеревоСообщений                  = Истина;
		
	КонецЕсли;
	
	// Устанавливаем переменные
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(Параметры.Контекст) Тогда
		
		Заголовок = Заголовок + НСтр("ru = ' (установлен дополнительный отбор)'");
		
		Если ЗначениеЗаполнено(Параметры.ДополнительныйКонтекст) Тогда
			
			ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Темы.Отбор.Элементы, "Контексты", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "Контекст", ВидСравненияКомпоновкиДанных.Равно, Параметры.Контекст, "Контекст", Истина);
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "Контекст", ВидСравненияКомпоновкиДанных.Равно, Параметры.ДополнительныйКонтекст, "ДополнительныйКонтекст", Истина);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Контекст", Параметры.Контекст);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Рассылка) Тогда
		
		Заголовок = Заголовок + НСтр("ru = ' (установлен отбор тем рассылки)'");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Темы.Отбор, "Рассылка", Параметры.Рассылка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Тема) Тогда
		
		ДанныеТемы         = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Тема, "Наименование, Кому, Контекст, Закрыта");
		Заголовок          = ДанныеТемы.Наименование;
		ЭтоФорум           = Параметры.ЭтоФорум;
		ТекущийКонтекст    = ДанныеТемы.Контекст;
		ТекущийАдресат     = ДанныеТемы.Кому;
		ТекущаяТема        = Параметры.Тема;
		ТекущаяТемаЗакрыта = ДанныеТемы.Закрыта;
		
	КонецЕсли;
		
	// Управляем видимостью элементов
		
	Темы.Параметры.УстановитьЗначениеПараметра("Пользователь", ТекущийПользователь);
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
	Участники.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	УстановитьАктивностьПользователя(ТекущийПользователь);
	
	Элементы.Участники.Видимость       = Ложь;
	Элементы.ГруппаНастройки.Видимость = Ложь;
	Элементы.КомандаИнформация.Пометка = Истина;
	
	Элементы.ГруппаКомандыУправленияУчастниками.Видимость = УправлениеДоступом.ЕстьРоль("УправлениеКоммуникациямиСУО");
	
	Если ЗначениеЗаполнено(Параметры.Тема) Тогда
		
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;	
		
		Элементы.ГруппаТемы.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Тема) Тогда
		Элементы.ГруппаИнформация.Видимость = Ложь;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборТем();
	ЗагрузитьОбсуждение(Истина);
	
	УстановитьПериодОбновленияСпискаТем();
	
	УстановитьПериодОбновленияИнформацииОбАктивностиУчастников();
	УстановитьПериодОбновленияСообщений();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьАктивностьПользователя", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноСообщениеОбсуждения"
		И Источник <> ЭтотОбъект Тогда
		
		Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ЗакрытиеФормыОбщения");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

// Темы

&НаКлиенте
Процедура Настройки(Команда)
	
	Кнопка = Элементы.КомандаНастройки;
	
	Кнопка.Пометка = ?(Кнопка.Пометка, Ложь, Истина);
	
	Если Кнопка.Пометка Тогда
		Элементы.ГруппаНастройки.Видимость = Истина;
	Иначе
		Элементы.ГруппаНастройки.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(Параметры.Контекст) Тогда
		ПараметрыФормы.Вставить("Контекст", Параметры.Контекст);
	КонецЕсли;
	
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура Пометить(Команда)
	ИзменитьСтатусТемыНаКлиенте("Помечена");
КонецПроцедуры

&НаКлиенте
Процедура Архивировать(Команда)
	ИзменитьСтатусТемыНаКлиенте("Архивирована", Истина);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ИзменитьСтатусТемыНаКлиенте("Удалена", Истина);
КонецПроцедуры

&НаКлиенте
Процедура Восстановить(Команда)
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("Архивирована");
	МассивРеквизитов.Добавить("Удалена");
	
	МассивЗначений = Новый Массив();
	МассивЗначений.Добавить(Ложь);
	МассивЗначений.Добавить(Ложь);
	
	ИзменитьСтатусТемыНаКлиенте(МассивРеквизитов, МассивЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда=Неопределено)
	
	Если НЕ ЭтоФорум Тогда
		
		Элементы.Темы.Обновить();
		Подключаемый_ОбновитьСтатусыПользователей();
		
	КонецЕсли;
	
	ЗагрузитьОбсуждение();
	
КонецПроцедуры

&НаКлиенте
Процедура Входящие(Команда)
	УстановитьОтборТем("Входящие");
КонецПроцедуры

&НаКлиенте
Процедура Новые(Команда)
	УстановитьОтборТем("Новые");
КонецПроцедуры

&НаКлиенте
Процедура Помеченные(Команда)
	УстановитьОтборТем("Помеченные");
КонецПроцедуры

&НаКлиенте
Процедура Отправленные(Команда)
	УстановитьОтборТем("Отправленные");
КонецПроцедуры

&НаКлиенте
Процедура ВсеТемы(Команда)
	УстановитьОтборТем("Все");
КонецПроцедуры

&НаКлиенте
Процедура Корзина(Команда)
	УстановитьОтборТем("Корзина");
КонецПроцедуры

// Обсуждение темы

&НаКлиенте
Процедура Отправить(Команда)
	
	СохранитьСообщениеНаСервере(ТекущаяТема);
	ЗагрузитьОбсуждение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьУчастников(Команда)
	
	Кнопка = Элементы.КомандаПоказатьСкрытьУчастников;
	
	Кнопка.Пометка = ?(Кнопка.Пометка, Ложь, Истина);
	
	Если Кнопка.Пометка Тогда
		Элементы.Участники.Видимость = Истина;
		ЗагрузитьОбсуждение();
	Иначе
		Элементы.Участники.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Информация(Команда)
	
	Кнопка = Элементы.КомандаИнформация;
	
	Кнопка.Пометка = ?(Кнопка.Пометка, Ложь, Истина);
	
	Если Кнопка.Пометка Тогда
		Элементы.ГруппаИнформация.Видимость = Истина;
	Иначе
		Элементы.ГруппаИнформация.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрикрепитьФайлПродолжение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаФайловСУ", Новый Структура("УникальныйИдентификаторФормыВладельца, ИнформацияОПрикрепленныхФайлах", УникальныйИдентификатор, ИнформацияОПрикрепленныхФайлах),,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПрикрепленныхФайлов = Новый Массив;
	
	Для каждого Строка Из РезультатЗакрытия Цикл
		
		ОписаниеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Строка.ПолноеИмя);
		ОписаниеФайла.Вставить("Адрес", Строка.АдресВХранилище);
		
		МассивПрикрепленныхФайлов.Добавить(ОписаниеФайла);
	
	КонецЦикла;
	
	ИнформацияОПрикрепленныхФайлах = Новый ФиксированныйМассив(МассивПрикрепленныхФайлов); // Запоминаем в реквизите формы
	
	Элементы.ИнформацияОПрикрепленномФайле.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Прикреплено файлов: %1'"), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ИнформацияОПрикрепленныхФайлах.Количество()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСообщение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВопросаОбОчисткеСообщения", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить новое сообщение?'"), РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОбОчисткеСообщения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;	
	
	Сообщение.Удалить();
	ИнформацияОПрикрепленномФайле = Неопределено;
	Элементы.ИнформацияОПрикрепленномФайле.Заголовок = "";
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	
	Тема = ТекущаяТема;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораУчастникаДляДобавления", ЭтотОбъект, Тема);
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчастникаДляДобавления(ВыбранныйПользователь, Тема) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИлиИсключитьУчастникаОбсуждения(Тема, ВыбранныйПользователь, "Добавить");
	
	Элементы.Участники.Обновить();
	
	ТекстПредупреждения = НСтр("ru = 'Пользователь ""%1"" добавлен к обсуждению'");
	ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, ВыбранныйПользователь);

	ПоказатьПредупреждение(,ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьУчастника(Команда)
	
	Тема = ТекущаяТема;
	
	СписокУчастниковОбсуждения = ПолучитьУчастниковОбсуждения(Тема);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораУчастникаДляИсключения", ЭтотОбъект, Тема);
	СписокУчастниковОбсуждения.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите пользователя для исключения из обсуждения'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчастникаДляИсключения(ВыбранноеЗначениеСписка, Тема) Экспорт
	
	Если ВыбранноеЗначениеСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИлиИсключитьУчастникаОбсуждения(Тема, ВыбранноеЗначениеСписка.Значение, "Исключить");
	
	Элементы.Участники.Обновить();
	
	ТекстПредупреждения = НСтр("ru = 'Пользователь ""%1"" исключен из обсуждения'");
	ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, ВыбранноеЗначениеСписка.Значение);

	ПоказатьПредупреждение(,ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваТемы(Команда)
	
	ПоказатьЗначение(,ТекущаяТема);

КонецПроцедуры

// Настройки

&НаКлиенте
Процедура НовыеСообщениеРазмещатьВверхуПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбсуждениеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если НЕ ДанныеСобытия.Свойство("Href") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(ДанныеСобытия.Href);
	
	Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
	
	Если ЗначениеЗаполнено(Действие) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Действие = "edit" Тогда
			
			НомерСообщения = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "message");
			
			ДокументСообщения = ПолучитьДокументСообщения(НомерСообщения);
			
			Если ЗначениеЗаполнено(ДокументСообщения) Тогда
				ПоказатьЗначение(,ДокументСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Действие = "reply" Тогда
			
			НомерСообщения = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "message");
			
			ДокументСообщения = ПолучитьДокументСообщения(НомерСообщения);
			
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаСообщение", ЭтотОбъект);
			
			ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", Новый Структура("Тема, Контекст, РодительскоеСообщение", ТекущаяТема, ТекущийКонтекст, ДокументСообщения),,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
		Если Действие = "user" Тогда
			
			ИдентификаторПользователя = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "ref");
			ИдентификаторПользователя = Новый УникальныйИдентификатор(ИдентификаторПользователя);
			
			АвторСообщения = ПолучитьАвтораСообщения(ИдентификаторПользователя);
			
			Если ЗначениеЗаполнено(АвторСообщения) Тогда
				ПоказатьЗначение(,АвторСообщения);
			КонецЕсли;
		
		КонецЕсли;
		
		Если Действие = "attached" Тогда
			
			НомерСообщения = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "message");
			
			ДокументСообщения = ПолучитьДокументСообщения(НомерСообщения, УникальныйИдентификатор);
			
			Если ТипЗнч(ДокументСообщения) = Тип("Структура") Тогда
				
				ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДокументСообщения, Ложь);
				
			Иначе
				
				ПараметрыФормы = Новый Структура("ВладелецФайла, ТолькоПросмотр", ДокументСообщения, Истина);
				ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаСообщение(РезультатЗакрытия, ПараметрыОткрытия) Экспорт
	ЗагрузитьОбсуждение();
КонецПроцедуры


&НаКлиенте
Процедура ЧастотаОбновленияСпискаТемПриИзменении(Элемент)
	УстановитьПериодОбновленияСпискаТем();
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаПроверкиСтатусаУчастниковПриИзменении(Элемент)
	УстановитьПериодОбновленияИнформацииОбАктивностиУчастников();
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаОбновленияСообщенийПриИзменении(Элемент)
	УстановитьПериодОбновленияСообщений();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Темы

&НаКлиенте
Процедура ТемыПриАктивизацииСтроки(Элемент)
	
	ЗагрузитьОбсуждение();
	
КонецПроцедуры
